Урок 1. Знакомство с языком программирования С#
Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3

Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22

Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка(number%2==0)).

4 -> да
-3 -> нет
7 -> нет

Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

5 -> 2, 4
8 -> 2, 4, 6, 8

1.первая задача
Console.WriteLine("Введите первое число");
int a = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите второе число");
int b = int.Parse(Console.ReadLine()!);
if(a > b){
    Console.WriteLine("максимальное число " + a);
}
else{
    Console.WriteLine("максимальное число " + b);
}

2.вторая задача
Console.WriteLine("Введите первое число");
int a = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите второе число");
int b = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите третье число");
int c = int.Parse(Console.ReadLine()!);
int max = a;
if(max < b) max = b;
if(max < c) max = c;
Console.WriteLine("максимальное число " + max);

3.третья задача
Console.WriteLine("Введите число ");
int a = int.Parse(Console.ReadLine()!);
if(a % 2 == 0){
    Console.WriteLine("Число четное ");
}
else{
    Console.WriteLine("Число нечетное ");
}
4.четвертая задача
Console.WriteLine("Введите число N: ");
int n = int.Parse(Console.ReadLine()!);
int a = 1;
while(a < n){
    if(a%2 == 0){
       Console.WriteLine(a); 
    }
    a++;
} 